Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: To release a lock (shared or exclusive), set operation to LOCK_UN (set to 3 prior to PHP 4.0.1).
es: flock() opera sobre fp el cual debe ser un apuntador a un fichero abierto. operation toma uno de los siguientes valores:

source: flock() allows you to perform a simple reader / writer model which can be used on virtually every platform (including most Unix derivatives and even Windows).
es: Para que adquiera un bloqueo compartido (lectura), fija operation a 1.

source: Check your operating system documentation for more details.
es: Si no quieres que flock() bloquee mientras está activado, suma 4 al valor de operation.

source: When using a multithreaded server API like ISAPI you may not be able to rely on flock() to protect files against other PHP scripts running in parallel threads of the same server instance!
es: flock() permite establece un modelo simple de lectura / escritura el cual puede usarse en prácticamente cualquier plataforma (incluyendo la mayoria de sistemas Unix e incluso Windows).

source: flock() is not supported on antiquated filesystems like FAT and its derivates and will therefore always return FALSE under this environments (this is especially true for Windows 98 users).
es: flock() devuelve TRUE en caso de éxito y FALSE en caso de error (ej. cuando no se puede establecer un bloqueo).

source: Returns the next lowest integer value by rounding down value if necessary.
es: Devuelve el valor entero inferior más cercano a number.

source: The return value of floor() is still of type float because the value range of float is usually bigger than that of integer.
es: El uso de floor() con enteros es una perdida de tiempo absoluta.

source: Example 1. floor() example
es: Use: $new = (double)floor($number); para tener el comportamiento antiguo.

source: See also ceil() and round().
es: Vea también ceil() y round().

source: Netscape, for example, buffers text until it receives an end-of-line or the beginning of a tag, and it won 't render tables until the / table tag of the outermost table is seen.
es: Flushes the output buffers of PHP and whatever backend PHP is using (CGI, a web server, etc.) This effectively tries to push all the output so far to the user 's browser.

source: If filename is of the form "scheme: / /.. .", it is assumed to be a URL and PHP will search for a protocol handler (also known as a wrapper) for that scheme.
es: Si filename comienza con "http: / /" (no es sensible a mayúsculas), se abre una conexión HTTP 1.0 hacia el servidor especificado y se devuelve un apuntador de fichero al comienzo del texto de respuesta.

source: If no wrappers for that protocol are registered, PHP will emit a notice to help you track potential problems in your script and then continue as though filename specifies a regular file.
es: No maneja redirecciones HTTP, por eso se debe incluir una barra final cuando se trata de directorios.

source: The file must be accessible to PHP, so you need to ensure that the file access permissions allow this access.
es: Si filename comienza con "ftp: / /" (no es sensible a mayúsculas), se abre una conexión ftp hacia el servidor especificado y se devuelve un apuntador al fichero requerido.

source: If you have enabled safe_mode, or open_basedir further restrictions may apply.
es: Si el servidor no soporta ftp en modo pasivo, esto fallará.

source: If PHP has decided that filename specifies a registered protocol, and that protocol is registered as a network URL, PHP will check to make sure that allow_url_fopen If PHP has decided that filename specifies a registered protocol, and that protocol is registered as a network URL, PHP will check to make sure that allow_url_fopen is enabled.
es: Si filename no comienza con nada de lo anterior, el fichero se abre del sistema de ficheros, y se devuelve un apuntador al fichero abierto.

source: The list of supported protocols can be found in Appendix I.
es: mode puede ser cualquiera de lo siguiente:

source: It may be any of the following:
es: 'r' - Abre para sólo lectura; sitúa el apuntador del fichero al comienzo del mismo.

source: 'r' - Open for reading only; place the file pointer at the beginning of the file.
es: 'r+' - Abre para lectura y escritura; situa el apuntador del fichero al comienzo del fichero.

source: 'w' - Open for writing only; place the file pointer at the beginning of the file and truncate the file to zero length.
es: 'w' - Abre para sólo escritura; sitúa el apuntador del fichero al comienzo del fichero y trunca el fichero con longitud cero.

source: If the file does not exist, attempt to create it.
es: Si el fichero no existe, trata de crearlo.

source: 'a' - Open for writing only; place the file pointer at the end of the file.
es: Si el fichero no existe, trata de crearlo.

source: 'a+' - Open for reading and writing; place the file pointer at the end of the file.
es: 'a' - Abre sólo para escribir (añadir); sitúa el apuntador del fichero al final del mismo.

source: This is useful only on systems which differentiate between binary and text files (i.e.
es: 'a+' - Abre para lectura y escritura (añadiendo); sitúa el apuntador del fichero al final del mismo.

source: It' s useless on Unix).
es: Si el fichero no existe, trata de crearlo.

source: You are encouraged to include the 'b' flag in order to make your scripts more portable.
es: Puede usarse el tercer parámetro opcional y fijarlo a "1", si también se quiere buscar el fichero en el include_path.

source: The optional third use_include_path parameter can be set to '1' or TRUE if you want to search for the file in the include_path, too.
es: Ejemplo de fopen( )()

source: If the open fails, the function returns FALSE.
es: $fp = fopen( "/ home / rasmus / file.txt", "r"); $fp = fopen("http: / /www.php.net /", "r"); $fp = fopen("ftp: / /user:password@example.com / ", "w");

source: ?php $handle = fopen ("/ home / rasmus / file.txt", "r"); $handle = fopen (" / home / rasmus / file.gif", "wb"); $handle = fopen ("http: / /www.example.com /", "r"); $handle = fopen ("ftp: / /user:password@example.com / somefile.txt", "w");?
es: Si experimentas problemas a la hora de leer y escribir a ficheros y estas usando la version de PHP como módulo para el servidor, recuerda que debes asegurar que los ficheros y directorios que estas usando son accesibles al proceso servidor.

source: On the Windows platform, be careful to escape any backslashes used in the path to the file, or use forward slashes.
es: En la plataforma Windows, ten cuidado de escribir correctamente las barras invertidas en el path del fichero (poniéndolas dobles), o usa barras directas.

source: ?php $handle = fopen ("c:\\data\\info.txt", "r");?
es: $fp = fopen( "c:\\data\\info.txt", "r");

source: See also Appendix I, fclose(), fgets(), fsockopen(), file(), file_exists(), is_readable(), socket_set_timeout(), and popen().
es: Ver también fclose(), fsockopen(), y popen().

source: Otherwise, fpassthru() returns the number of characters read from handle and passed through to the output.
es: Lee hasta el EOF del fichero apuntado y escribe los resultados a la salida estándar (stdout).

source: The file is closed when fpassthru() is done reading it (leaving handle useless).
es: El apuntador al fichero debe ser válido, y debe apuntar a un fichero abierto con éxito por fopen(), popen(), o fsockopen().

source: You are encouraged to use the b flag when dealing with binary files, even if your system does not require it, so that your scripts will be more portable.
es: Si sólo quieres volcar el contenido de un fichero a stdout puedes If you just want to dump the contents of a file to stdout you may usar la función readfile(), la cual te libra de la llamada a fopen().

source: See also readfile(), fopen(), popen(), and fsockopen()
es: Ver también readfile(), fopen(), popen(), y fsockopen()

source: Example 1. sprintf(): zero-padded integers
es: Ejemplo 1. sprintf(): zero-padded integers

source: Example 2. sprintf(): formatting currency
es: Ejemplo 2. sprintf(): formatting currency

source: fputs() is an alias to fwrite(), and is identical in every way.
es: fputs() es un alias de fwrite(), y es idéntico a él en todo.

source: Note that the length parameter is optional and if not specified the entire string will be written.
es: Notar que el parámetro length es opcional y si no se pone la cadena entera será escrita.

source: Reading stops when length bytes have been read or EOF (end of file) reached, whichever comes first.
es: fread() lee hasta length bytes del apuntador de fichero referenciado por fp.

source: Windows) the file must be opened with'b 'included in fopen() mode parameter.
es: / / Mete el contenido de un fichero en una cadena $filename = "/ usr / local / something.txt"; $fd = fopen ($filename, "r"); $contents = fread ($fd, filesize ($filename)); fclose ($fd);

source: See also fwrite(), fopen(), fsockopen(), popen(), fgets(), fgetss(), fscanf(), file(), and fpassthru().
es: Ver también fwrite(), fopen(), fsockopen(), popen(), fgets(), fgetss(), file(), y fpassthru().

source: Converts a date from the French Republican Calendar to a Julian Day Count.
es: Convierte una fecha del Calendario Republicano Francés a la Cuenta de Días Juliana.

source: These routines only convert dates in years 1 through 14 (Gregorian dates 22 September 1792 through 22 September 1806).
es: Estas rutinas sólo convierten fechas entre los años 1 y 14 (fechas Gregorianas del 22 de septiembre de 1792 al 22 de septiembre de 1806).

source: This more than covers the period when the calendar was in use.
es: Esto cubre ampliamente el periodo en el que estuvo en uso este calendario.

source: FTP functions
es: Funciones FTP

source: Example 1. fscanf() Example
es: Ejemplo 1. fscanf() Example

source: Example 2. users.txt
es: Ejemplo 2. users.txt

source: Sets the file position indicator for the file referenced by handle .The new position, measured in bytes from the beginning of the file, is obtained by adding offset to the position specified by whence, whose values are defined as follows:
es: Fija el indicador de posición del fichero referenciado por fp a tantos bytes como indica offset.

source: SEEK_CUR - Set position to current location plus offset.
es: Es equivalente a la llamada (en C) fseek(fp, offset, SEEK_SET).

source: If whence is not specified, it is assumed to be SEEK_SET.
es: Si va bien, devuelve 0; en otro caso, devuelve -1.

source: Note that seeking past EOF is not considered an error.
es: Tener en cuenta que situarse más alla de EOF no se considera un error.

source: See also ftell() and rewind().
es: Ver también ftell() y rewind().

source: Initiates a stream connection in the Internet (AF_INET, using TCP or UDP) or Unix (AF_UNIX) domain.
es: Inicia una conexión de dominio Internet (AF_INET) o Unix (AF_UNIX).

source: For UDP connections, you need to explicitly specify the protocol by prefixing hostname with 'udp: / /'.
es: Para el domino Internet, abrirá una conexión TCP hacia el ordenador hostname en el puerto port.

source: The optional timeout can be used to set a timeout in seconds for the connect system call.
es: Para el dominio Unix, hostname se usará como ruta al socket, port debe ser 0 para este caso.

source: If you need to set a timeout for reading / writing data over the socket, use socket_set_timeout(), as the timeout parameter to fsockopen() only applies while connecting the socket.
es: El parámetro opcional timeout se puede usar para especificar un timeout en segundos para establecer la conexión.

source: fsockopen() returns a file pointer which may be used together with the other file functions (such as fgets(), fgetss(), fputs(), fclose(), and feof()).
es: fsockopen() devuelve un puntero a fichero, el cual se puede usar junto con las otras funciones de ficheros (como fgets(), fgetss(), fputs(), fclose(), feof()).

source: If the value returned in errno is 0 and the function returned FALSE, it is an indication that the error occurred before the connect() call.
es: Si la llamada falla, esta devolverá falso y si los parámetros opcionales errno y errstr están presentes, indicarán el error del sistema que ocurrió en la llamada connect().

source: Note that the errno and errstr arguments will always be passed by reference.
es: Si errno es 0 y la función devolviá falso, nos indica que el error ocurrió antes de la llamada connect().

source: The socket will by default be opened in blocking mode.
es: Esto es debido principalmente a problemas inicializando el socket.

source: Example 1. fsockopen() Example
es: Observe que los argumentos errno y errstr deben ser pasados por referencia.

source: ?php $fp = fsockopen( "udp: / /127.0.0.1", 13, $errno, $errstr); if (!$fp) {echo "ERROR: $errno - $errstr br \n";} else {fwrite($fp ,"\n"); echo fread($fp, 26); fclose($fp);}?
es: Por defecto, el socket será abierto en modo de bloqueo.

source: UDP sockets will sometimes appear to have opened without an error, even if the remote host is unreachable.
es: Puede cambiarlo a modo de no bloqueo usando set_socket_blocking().

source: The error will only become apparent when you read or write data to / from the socket.
es: Ejemplo 1. ejemplo con fsockopen

source: Returns the position of the file pointer referenced by handle; i.e., its offset into the file stream.
es: Devuelve la posición del apuntador de fichero referenciado por fp; es decir, la distancia en la secuencia del fichero.

source: If an error occurs, returns FALSE.
es: Si ocurre un error, devuelve FALSE.

source: The file pointer must be valid, and must point to a file successfully opened by fopen() or popen().
es: El apuntador al fichero debe ser válido, y debe referirse a The file pointer must be valid, and must point to a file un fichero abierto con éxito por fopen() o popen().

source: See also fopen(), popen(), fseek(), and rewind().
es: Ver también fopen(), popen(), fseek() y rewind().

source: Changes to the parent directory.
es: En caso de error, devuelve FALSE.

source: Changes to the specified directory.
es: En caso de error, devuelve FALSE.

source: Returns TRUE on success or FALSE on error.
es: Cambia al directorio especificado por el parámetro directory.

source: ftp_connect() opens an FTP connection to the specified host.
es: Si tiene éxito, devuelve un flujo FTP.

source: The port The port parameter specifies an alternate port to connect to.
es: En caso de error, devuelve FALSE.

source: The timeout parameter specifies the timeout for all subsequent network operations.
es: ftp_connect() establece una conexión FTP al host ftp_connect() establece una conexión FTP al host especificado.

source: The timeout can be changed and queried at any time with ftp_set_option() and ftp_get_option().
es: El parámetro port especifica un puerto alternativo al que conectar.

source: The timeout parameter became available in PHP 4.2.0.
es: Si se omite o es cero, se usa el puerto FTP por defecto, 21.

source: ftp_delete() deletes the file specified by path from the FTP server.
es: En caso de error, devuelve FALSE.

source: ftp_fget() retrieves remote_file from the FTP server, and writes it to the given file pointer, fp.
es: Si tiene éxito, devuelve TRUE.

source: The transfer mode specified must be either FTP_ASCII or FTP_BINARY.
es: En caso de error, devuelve FALSE.

source: The resumepos parameter was added in PHP 4.3.0.
es: ftp_fget() baja el fichero remote_file del servidor FTP, y lo escribe en el puntero a fichero fp.

source: See also ftp_get().
es: El modo de transferencia especificado por el parámetro mode debe ser FTP_ASCII o bien FTP_BINARY.

source: ftp_fput() uploads the data from the file pointer fp until the end of the file is reached.
es: En caso de error, devuelve FALSE

source: The results are stored in remote_file on the FTP server.
es: ftp_fput() sube los datos apuntados por el puntero a fichero fp hasta alcanzar el final del fichero.

source: ftp_get() retrieves remote_file from the FTP server, and saves it to local_file ftp_get() retrieves remote_file from the FTP server, and saves it to local_file locally.
es: Si tiene éxito, devuelve TRUE.

source: See also ftp_fget() and ftp_async_get().
es: El modo de transferencia especificado por el parámetro mode debe ser FTP_ASCII o bien FTP_BINARY.

source: Example 1. ftp_get_option() example
es: Ejemplo 1. ftp_get_option() example

source: Logs in to the given FTP stream.
es: En caso de error, devuelve FALSE.

source: ftp_mdtm() checks the last modified time for a file, and returns it as a UNIX timestamp.
es: En caso de error, devuelve -1.

source: If an error occurs, or the file does not exist, -1 is returned.
es: ftp_mdtm() comprueba la fecha de última modificación de un fichero, y la devuelve como una marca de tiempo UNIX.

source: Returns a UNIX timestamp on success, or -1 on error.
es: Si se produce algún error, o el fichero no existe, devuelve -1.

source: Not all servers support this feature!
es: Tenga en cuenta que no todos los servidores soportan esta característica.

source: Creates the specified directory.
es: En caso de error, devuelve FALSE.

source: Returns the newly created directory name on success or FALSE on error.
es: Crea el directorio especificado por el parámetro directory.

source: Example 1. ftp_nb_get() example
es: Ejemplo 1. ftp_nb_get() example

source: Example 1. ftp_nb_put() example
es: Ejemplo 1. ftp_nb_put() example

source: Returns an array of filenames from the specified directory on success or FALSE on error.
es: En caso de error, devuelve FALSE.

source: It turns off passive mode if pasv is FALSE.
es: Si tiene éxito, devuelve TRUE.

source: In passive mode, data connections are initiated by the client, rather than by the server.
es: En caso de error, devuelve FALSE.

source: ftp_put() stores local_file on the FTP server, as remote_file.
es: Si tiene éxito, devuelve TRUE.

source: $upload = ftp_put( $conn_id, $destination_file, $source_file, FTP_ASCII);
es: El modo de transferencia especificado por el parámetro mode debe ser FTP_ASCII o bien FTP_BINARY.

source: Returns the current directory or FALSE on error.
es: Devuelve el directorio actual, o FALSE en caso de error.

source: ftp_quit() is an alias for ftp_close().
es: ftp_connect() cierra el flujo FTP ftp_stream.

source: ftp_rawlist() executes the FTP LIST command, and returns the result as an array.
es: ftp_rawlist() ejecuta el comando FTP LIST, y devuelve el resultado como un array.

source: Each array element corresponds to one line of text.
es: Cada elemento del array corresponde a una línea de texto.

source: The output is not parsed in any way.
es: La salida no se procesa de ninguna forma.

source: The system type identifier returned by ftp_systype() can be used to determine how the results should be interpreted.
es: Se puede utilizar el identificador de tipo de sistema devuelto por ftp_systype() para determinar cómo se deben interpretar los resultados.

source: ftp_rename() renames the file or directory that is currently named from to the new name to, using the FTP stream ftp_stream.
es: En caso de error, devuelve FALSE.

source: Removes the specified directory.
es: En caso de error, devuelve FALSE.

source: Example 1. ftp_set_option() example
es: Ejemplo 1. ftp_set_option() example

source: If an error occurs, of if the file does not exist, -1 is returned.
es: Si tiene éxito devuelve el tamaño del fichero, o -1 en caso de error.

source: Returns the file size on success, or -1 on error.
es: No todos los servidores soportan esta característica.

source: Returns the remote system type, or FALSE on error.
es: Devuelve el tipo de sistema remoto, o FALSE en caso de error.

source: Returns the argument which is at the arg_num 'th offset into a user-defined function's argument list.
es: Devuelve el argumento que está en la posición arg_num en la lista de argumentos de una función definida por el usuario.

source: Function arguments are counted starting from zero. func_get_arg() will generate a warning if called from outside of a function definition.
es: Los argumentos de la función se cuentan comenzando por la posición cero. func_get_arg() generará un aviso si se llama desde fuera de la definición de la función.

source: If arg_num is greater than the number of arguments actually passed, a warning will be generated and func_get_arg() will return FALSE.
es: Si arg_num es mayor que el número de argumentos pasados realmente, se generará un aviso y func_get_arg() devolverá FALSE.

source: func_get_arg() may be used in conjunction with func_num_args() and func_get_args() to allow user-defined functions to accept variable-length argument lists.
es: func_get_arg() puede utilizarse conjuntamente con func_num_args() y func_get_args() para permitir a las funciones definidas por el usuario que acepten listas de argumentos de longitud variable.

source: This function was added in PHP 4.
es: Esta función fue añadida en PHP 4.

source: Returns an array in which each element is the corresponding member of the current user-defined function' s argument list. func_get_args() will generate a warning if called from outside of a function definition.
es: Devuelve un array en el que cada elemento es el miembro correspondiente de la lista de argumentos de la función definida por el usuario actual. func_get_args() generará un aviso si es llamada desde fuera de la definición de la función.

source: func_get_args() may be used in conjunction with func_num_args() and func_get_arg() to allow user-defined functions to accept variable-length argument lists.
es: func_get_args() puede utilizarse conjuntamente con func_num_args() y func_get_arg() para permitir a las funciones definidas por el usuario que acepten listas de argumentos de longitud variable.

source: Returns the number of arguments passed into the current user-defined function. func_num_args() will generate a warning if called from outside of a user-defined function.
es: Devuelve el número de argumentos pasados a la función actual definida por el usuario. func_num_args() generará un aviso si es llamada desde fuera de la definición de la función.

source: func_num_args() may be used in conjunction with func_get_arg() and func_get_args() to allow user-defined functions to accept variable-length argument lists.
es: Nota:

source: See also method_exists() and get_defined_functions().
es: Devuelve TRUE si encuentra el nombre de función dado, FALSE en otro caso.

source: fwrite() returns the number of bytes written, or FALSE on error.
es: fwrite() escribe el contenido de string al fichero apuntado por fp.

source: See also fread(), fopen(), fsockopen(), popen(), and fputs().
es: Ver también fread(), fopen(), fsockopen(), popen(), y fputs().

source: getallheaders() is an alias for apache_request_headers().
es: Esta función devuelve asociados en un vector todas las cabeceras de la actual petición HTTP.

source: Please read the apache_request_headers() documentation for more information on how this function works.
es: También puedes obtener los valores de las variables de los CGIs mediante variables de entorno, que funcionan, esté o no el PHP funcionando como módulo del Apache.

source: In PHP 4.3.0, getallheaders() became an alias for apache_request_headers().
es: Ejemplo 1.

source: Essentially, it was renamed.
es: ObtenerTodaslasCabeceras() Ejemplo

source: This is because this function only works when PHP is compiled as an Apache Module.
es: Nota:

source: See also apache_request_headers().
es: ObtenerTodaslasCabeceras() actualmente solo funcionará si el PHP es cargado como módulo del Apache.

source: get_browser() attempts to determine the capabilities of the user's browser.
es: get_browser() intenta determinar las características del navegador del usuario.

source: This is done by looking up the browser 's information in the browscap.ini file.
es: Para ello consulta el fichero de información del navegador, browscap.ini.
